## Plan Result (dev-apim_appgw)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_role_assignment.identity
  * module.app-gw.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "sdshmcts-apim00-dev-agw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "hmcts-hub-nonprodi"
      + tags                        = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = [
              + "firewall-nonprodi-palo-sdsapimgmtdev.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "sds-api-mgmt-appgw"
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-nonprodi-palo-sdsapimgmtdev.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "sds-mtls-api-mgmt-appgw"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sds-api-mgmt-appgw"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sds-api-mgmt-appgw"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sds-mtls-api-mgmt-appgw"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sds-mtls-api-mgmt-appgw"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/publicIPAddresses/sdshmcts-apim-appgw-dev-pip"
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.11.72.233"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/virtualNetworks/hmcts-hub-nonprodi/subnets/hub-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/virtualNetworks/hmcts-hub-nonprodi/subnets/hub-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "sds-api-mgmt-appgw.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "sds-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "sds-mtls-api-mgmt-appgw.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "sds-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "sds-mtls-api-mgmt-appgw-sslprofile"
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "sds-api-mgmt-appgw.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "sds-api-mgmt-appgw"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "sds-mtls-api-mgmt-appgw.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "sds-mtls-api-mgmt-appgw"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "sds-api-mgmt-appgw"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-mtls-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-mtls-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-mtls-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "sds-mtls-api-mgmt-appgw"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_profile {
          + id                               = (known after apply)
          + name                             = "sds-mtls-api-mgmt-appgw-sslprofile"
          + trusted_client_certificate_names = [
              + "sds-mtls-api-mgmt-appgw-trusted-cert",
            ]
          + verify_client_cert_issuer_dn     = true
        }

      + trusted_client_certificate {
          + data = (sensitive value)
          + id   = (known after apply)
          + name = "sds-mtls-api-mgmt-appgw-trusted-cert"
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.1"

          + exclusion {
              + match_variable          = "RequestArgNames"
              + selector                = "iss"
              + selector_match_operator = "Equals"
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "AppGw"
      + target_resource_id             = (known after apply)
    }

  # module.app-gw.azurerm_role_assignment.identity will be created
  + resource "azurerm_role_assignment" "identity" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.app-gw.azurerm_user_assigned_identity.identity will be created
  + resource "azurerm_user_assigned_identity" "identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "sdshmcts-apim-dev-agw"
      + principal_id        = (known after apply)
      + resource_group_name = "hmcts-hub-nonprodi"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":419,"Program":"tfcmt","SHA1":"","Target":"dev-apim_appgw","Vars":{}} -->